In [5]:
import pandas as pd
import numpy as np

In [153]:
df = pd.DataFrame({
    'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 'Budapest_PaRis', 'Brussels_londOn'], 
 
    'FlightNumber': [10045, np.nan, 10065, np.nan, 10085], 
 
    'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]], 
 
    'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', '12. Air France', '"Swiss Air"']})

In [154]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [160]:
"""
1. Some values in the the FlightNumber column are missing. These numbers are meant to increase by 10 with each
row so 10055 and 10075 need to be put in place. Fill in these missing numbers and make the column an
integer column (instead of a float column)
"""
for i in range(df.FlightNumber.size):
    if np.isnan(df.FlightNumber[i]):
        df.FlightNumber[i]= df.FlightNumber[i-1]+10
#import copy
#df_tmp = copy.deepcopy(df)
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN       10055.0            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis       10075.0          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [162]:
"""
2. The From_To column would be better as two separate columns! Split each string on the underscore 
delimiter _ to give a new temporary DataFrame with the correct values. Assign the correct column names to this 
temporary DataFrame
"""
df_tmp=pd.DataFrame(df.From_To.str.split("_",1).tolist(),columns=['From','To'])

#df.From_To.str.split("_",1).tolist()

In [146]:

df_tmp.drop(axis=1,columns='From_To',inplace=True)

In [163]:
df_tmp

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

In [103]:
##rearranging column order
cols = df_tmp.columns.tolist()
cols
cols= cols[-2:]+cols[:-2]
cols
df_tmp[cols]
df_tmp =df_tmp[cols]
df_tmp

In [148]:
#df_tmp = df_tmp[['From','To','FlightNumber','RecentDelays','Airline']]

In [ ]:
"""3. Notice how the capitalisation of the city names is all mixed up in this temporary DataFrame.
Standardise the strings so that only the first letter is uppercase (e.g. "londON" should become "London".) """

In [164]:
df_tmp.From= df_tmp.From.str.title()

In [165]:
df_tmp

       From         To
0    London      paris
1    Madrid      miLAN
2    London  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

In [166]:
"""
4. Delete the From_To column from df and attach the temporary DataFrame from the previous questions. 
"""
df.drop(axis=1,columns='From_To',inplace=True)
df[df_tmp.columns] =df_tmp

   FlightNumber  RecentDelays              Airline      From         To
0       10045.0      [23, 47]               KLM(!)    London      paris
1       10055.0            []    <Air France> (12)    Madrid      miLAN
2       10065.0  [24, 43, 87]  (British Airways. )    London  StockhOlm
3       10075.0          [13]       12. Air France  Budapest      PaRis
4       10085.0      [67, 32]          "Swiss Air"  Brussels     londOn

In [241]:
"""
5. In the RecentDelays column, the values have been entered into the DataFrame as a list. 
We would like each first value in its own column, each 
second value in its own column, and so on. If there isn't an Nth value, the value should be NaN. """
#np.array(df.RecentDelays)
df.RecentDelays

pandas.core.series.Series